<a href="https://colab.research.google.com/github/RsdTanmoy/Machine-Learning-Pandas/blob/main/Pandas_Lecture_12(Join_Method).ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

**Pandas Join() Method**

In [ ]:
import pandas as pd

In [ ]:
df1 = pd.DataFrame({'A': [1,2,3],
                   'B': [10,20,30]})
 
 
df2 = pd.DataFrame({'C': [4,5,6],
                   'D': [40,50,60]})
 
display(df1, df2)

   A   B
0  1  10
1  2  20
2  3  30

   C   D
0  4  40
1  5  50
2  6  60

In [ ]:
df1.join(df2)

   A   B  C   D
0  1  10  4  40
1  2  20  5  50
2  3  30  6  60

In [ ]:
df2.join(df1)

   C   D  A   B
0  4  40  1  10
1  5  50  2  20
2  6  60  3  30

In [ ]:
df1 = pd.DataFrame({'A': [1,2,3],
                   'B': [10,20,30]},index=['A','B','C'])
 
 
df2 = pd.DataFrame({'C': [4,5,6],
                   'D': [40,50,60]})
 
display(df1, df2)

   A   B
A  1  10
B  2  20
C  3  30

   C   D
0  4  40
1  5  50
2  6  60

In [ ]:
df1.join(df2)

   A   B   C   D
A  1  10 NaN NaN
B  2  20 NaN NaN
C  3  30 NaN NaN

In [ ]:
df1 = pd.DataFrame({'A': [1,2,3],
                   'B': [10,20,30]},index=['A','B','C'])
 
 
df2 = pd.DataFrame({'C': [4,5,6],
                   'D': [40,50,60]},index=['A','B','C'])
 
display(df1, df2)

   A   B
A  1  10
B  2  20
C  3  30

   C   D
A  4  40
B  5  50
C  6  60

In [ ]:
df1.join(df2)

   A   B  C   D
A  1  10  4  40
B  2  20  5  50
C  3  30  6  60

**Pandas join how**

In [ ]:
df3 = pd.DataFrame({'A': [1,2,3],
                   'B': [10,20,30]},index=['A','B','C'])
 
 
df4 = pd.DataFrame({'C': [5,6],
                   'D': [50,60]},index=['B','C'])
 
display(df3, df4)

   A   B
A  1  10
B  2  20
C  3  30

   C   D
B  5  50
C  6  60

In [ ]:
df3.join(df4)

   A   B    C     D
A  1  10  NaN   NaN
B  2  20  5.0  50.0
C  3  30  6.0  60.0

In [ ]:
df3.join(df4, how = 'right')

   A   B  C   D
B  2  20  5  50
C  3  30  6  60

In [ ]:
df3.join(df4, how = 'inner')

   A   B  C   D
B  2  20  5  50
C  3  30  6  60

**Pandas join lsuffix/rsuffix**

**when Column name is same**

In [ ]:
df1 = pd.DataFrame({'A': [1,2,3],
                   'B': [10,20,30]})
 
df2 = pd.DataFrame({'A': [4,5,6],
                   'D': [40,50,60]})
 
display(df1, df2)

   A   B
0  1  10
1  2  20
2  3  30

   A   D
0  4  40
1  5  50
2  6  60

In [ ]:
df1.join(df2, lsuffix='_1')

   A_1   B  A   D
0    1  10  4  40
1    2  20  5  50
2    3  30  6  60

In [ ]:
df1.join(df2, rsuffix='_1')

   A   B  A_1   D
0  1  10    4  40
1  2  20    5  50
2  3  30    6  60